In [1]:
import pandas as pd
import numpy as np

In [2]:
employees = pd.read_csv('data/toyota_number_of_employees.csv', index_col = 0)
employees

      Unconsolidated number of employees  Consolidated number of employees
Year
2007                               67650                            299394
2008                               69478                            316121
2009                               71116                            320808
2010                               71567                            320590
2011                               69125                            317716
2012                               69148                            325905
2013                               68978                            333498
2014                               68240                            338875
2015                               70037                            344109
2016                               72721                            348877
2017                               73875                            364445
2018                               74890                            369124
2019                               74515                            370870

In [24]:
# From the production data we only need the header and the worldwide production numbers
rows_to_keep = [0,32]
production = pd.read_csv('data/toyota_production_by_country.csv', skiprows = lambda x: x not in rows_to_keep, index_col = 0)
employees.index = production.transpose().index
employees.assign(worldwide_production = production.transpose())

,Unconsolidated number of employees,Consolidated number of employees,worldwide_production
2007,67650,299394,8534690
2008,69478,316121,8210818
2009,71116,320808,6371291
2010,71567,320590,7623349
2011,69125,317716,6928813
2012,69148,325905,8736529
2013,68978,333498,8892095
2014,68240,338875,9004825
2015,70037,344109,8929075
2016,72721,348877,8973988
2017,73875,364445,9007511
2018,74890,369124,8885573
2019,74515,370870,9053517

In [25]:
total_assets = pd.read_csv('data/toyota_total_assets.csv', index_col = 0)
total_assets

      Total assets (billions of yen)
Year
2007                       32574.779
2008                       32458.320
2009                       29062.037
2010                       30349.287
2011                       29818.166
2012                       30650.965
2013                       35483.317
2014                       41437.473
2015                       47729.830
2016                       47427.597
2017                       48750.186
2018                       50308.200
2019                       51936.900

In [ ]:
#employees['x'] = np.log(employees['Unconsolidated number of employees']/employees['K'])
#employees['y'] = np.log(employees['worldwide_production']/employees['K'])

#employees